Tekla Open API Reference for Tekla Structures 2025
ShapeSelectionForm Constructor
Overload List
Name | Description
ShapeSelectionForm(List<ShapeItem>)
 Initializes a new instance of the ShapeSelectionForm class.
ShapeSelectionForm(List<ShapeItem>, String)
 Initializes a new instance of the ShapeSelectionForm class, selecting the given Shape in the tree control.
Top
See Also
Reference
ShapeSelectionForm Class
Tekla.Structures.Dialog.UIControls Namespace